## Pandas 332 List

In [2]:
import pandas as pd
import numpy as np

## 176. Second Highest Salary [M]

Write a solution to find the second highest distinct salary from the Employee table.

If there is no second highest salary, return null (return None in Pandas).

In [5]:
data = [[1, 100], [2, 200], [3, 300]]
data = [[1, 100], [2, 200]]

employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

employee

   id  salary
0   1     100
1   2     200

In [25]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    top2 = employee['salary'].drop_duplicates().nlargest(2).sort_values(ascending=False).reset_index(drop=True)
    val = top2[1] if len(top2) >= 2 else None
    return pd.DataFrame({'SecondHighestSalary': [val]})

In [26]:
second_highest_salary(employee)

   SecondHighestSalary
0                  100

## 1757. Recyclable and Low Fat Products [E]

Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

In [29]:
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})
products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [ ]:
def find_products(products: pd.DataFrame) -> pd.DataFrame:
    return products.loc[ (products['low_fats']=='Y' & (products['recyclable']=='Y')) , :]

In [ ]:
find_products(products)